{
  "books": [
    {
      "id": 0,
      "imageUrl": "https://chitatel.by/storage/thumbs/dd/h248_w248_ddee0d170a6b7b48a206d2bd9c67e66c.jpg",
      "name": "The Wasp Factory",
      "types": [0, 1],
      "price": 4,
      "genre": "Horror",
      "category": 0,
      "popular": 4,
      "alt": "The Wasp Factory",
      "desc": "The Wasp Factory is written from a first person perspective, told by 16-year-old Francis Cauldhame (Frank), describing his childhood and all that remains of it. Frank observes many shamanistic rituals of his own invention, and it is soon revealed that Frank killed three children before he reached the age of ten himself."
    },
    {
      "id": 1,
      "imageUrl": "https://chitatel.by/storage/thumbs/e0/h248_w248_e0fbc67a21413318d8d55253d348d4df.jpg",
      "name": "Hunger",
      "types": [0, 1],
      "price": 7,
      "genre": "Romance",
      "category": 2,
      "popular": 6,
      "alt": "Hunger",
      "desc": "Hunger is loosely based on the author's own impoverished life before his breakthrough in 1890. Set in late 19th-century Kristiania (now Oslo), the novel recounts the adventures of a starving young man whose sense of reality is giving way to a delusionary existence on the darker side of a modern metropolis."
    },
    {
      "id": 2,
      "imageUrl": "https://chitatel.by/storage/thumbs/a9/h248_w248_a95e85bb6f739d494bad9180016b1410.jpg",
      "name": "Transformation",
      "types": [0, 1],
      "price": 10,
      "genre": "Classic",
      "category": 4,
      "popular": 4,
      "alt": "Transformation",
      "desc": "The story begins with a traveling salesman, Gregor Samsa, waking to find himself transformed into a large, monstrous insect-like creature."
    },
    {
      "id": 3,
      "imageUrl": "https://chitatel.by/storage/thumbs/2a/h248_w248_2a0ce04bdf93f864009a79ff1c053001.jpg",
      "name": "The Shadow Over Innsmouth",
      "types": [0, 1],
      "price": 10,
      "genre": "Horror",
      "category": 0,
      "popular": 2,
      "alt": "The Shadow Over Innsmouth",
      "desc": "The Shadow Over Innsmouth is a short novel about a weird hybrid race of humans and creatures resembling a cross between a fish and a frog, which lives in the seaside village of Innsmouth."
    },
    {
      "id": 4,
      "imageUrl": "https://chitatel.by/storage/thumbs/8f/h248_w248_8f10b58308f1fbb6a723beaecfa66523.jpg",
      "name": "It's me, Eddie",
      "types": [0, 1],
      "price": 8,
      "genre": "Romance",
      "category": 2,
      "popular": 8,
      "alt": "It's me, Eddie",
      "desc": "The plot is fictional but based on real experiences Limonov faced during his immigration to New York City.The protagonist is a man named Eddichka, a Russian immigrant in New York City. His wife has just divorced him, and he is collecting welfare whilst working at a restaurant. Eddichka attends Trotskyist meetings. The text of the novel uses obscenities and naturalistic descriptions of explicit sexual scenes."
    },
    {
      "id": 5,
      "imageUrl": "https://chitatel.by/storage/thumbs/96/h248_w248_964fcd712d3ff53338786284bcc3cd30.jpg",
      "name": "Snaff",
      "types": [0, 1],
      "price": 11,
      "genre": "Thriller",
      "category": 1,
      "popular": 2,
      "alt": "Snaff",
      "desc": "Cassie Wright, porn priestess, intends to cap her legendary career by breaking the world record for serial fornication on camera, with six hundred men. Snuff unfolds through the perspectives of Mr. 600, Mr. 72, Mr. 137, and Wright's personal assistant, Sheila. With his satirical narrative and thorough research, Chuck Palahniuk reveals through these four characters the little-known facts and histories of not only pornography and sexual deviance, but also acting and life in and out of the spotlight, and throughout the novel shows the rarely acknowledged presence of pornography in modern America."
    },
    {
      "id": 6,
      "imageUrl": "https://chitatel.by/storage/thumbs/96/h248_w248_9616755a5942001e2cc4b9febfef3e0e.jpg",
      "name": "Omon Ra",
      "types": [0, 1],
      "price": 12,
      "genre": "Romance",
      "category": 2,
      "popular": 9,
      "alt": "Omon Ra",
      "desc":"Omon is chosen to be trained in the Soviet space program the fulfillment of his lifelong dream. However, he enrolls only to encounter the terrifying absurdity of Soviet protocol and its backward technology: a bicycle-powered moonwalker the outrageous Colonel Urgachin and a one-way assignment to the moon. The New Yorker proclaimed: Omon's adventure is like a rocket firing off its various stages―each incident is more jolting and propulsively absurd than the one before."
    },
    {
      "id": 7,
      "imageUrl": "https://chitatel.by/storage/thumbs/1a/h248_w248_1a1d114d08e50ae580d18a29cb543268.jpg",
      "name": "Blue lard",
      "types": [0, 1],
      "price": 15,
      "genre": "Romance",
      "category": 2,
      "popular": 10,
      "alt": "Blue lard",
      "desc":"The book, Blue Lard, is a phantasmagoric tale featuring graphic sex scenes, including a tryst between clones of Soviet leader Joseph Stalin and Nikita Khruschev. A youth group that supports president Vladimir Putin has filed suit against Sorokin, charging him with disseminating pornography. Sorokin has filed a counter-suit."
    },
    {
      "id": 8,
      "imageUrl": "https://chitatel.by/storage/thumbs/ac/h248_w248_acb88640055240b80a9fc03592601ccb.jpg",
      "name": "Watchman",
      "types": [0, 1],
      "price": 3,
      "genre": "Graphic novel",
      "category": 3,
      "popular": 10,
      "alt": "Watchman",
      "desc": "Watchmen is an American comic book maxiseries by the British creative team of writer Alan Moore, artist Dave Gibbons and colorist John Higgins. It was published monthly by DC Comics in 1986 and 1987 before being collected in a single-volume edition in 1987. Watchmen originated from a story proposal Moore submitted to DC featuring superhero characters that the company had acquired from Charlton Comics. As Moore's proposed story would have left many of the characters unusable for future stories, managing editor Dick Giordano convinced Moore to create original characters instead."
    },
    {
      "id": 9,
      "imageUrl": "https://chitatel.by/storage/thumbs/99/h248_w248_9955939ad00bae88d46058b66b9c3bac.jpg",
      "name": "The Foundation Pit",
      "types": [0, 1],
      "price": 6,
      "genre": "Classic",
      "category": 4,
      "popular": 7,
      "alt": "The Foundation Pit",
      "desc": "The Foundation Pit portrays a group of workmen and local bureaucrats engaged in digging the foundation pit for what is to become a grand 'general' building where all the town's inhabitants will live happily and 'in silence.'"
    }
  ]
}
